# EndSym

## Description
Procedure EndSym completes symbol creation in VectorScript. When EndSym is called, the any procedure calls defined since a call to BeginSym are used to create the symbol.

```pascal
PROCEDURE EndSym;
```

```python
def vs.EndSym():
    return None
```

## Version
Availability: from All Versions

## Category
* Objects - Symbols